[
    {
        "title": "Use Italian textbooks",
        "references": {
            "info": "Some of these materials require a teacher, but others are suitable for self-study:",
            "links": [
                {
                    "link": "https://www.italianbookshop.co.uk/italianbooks/series/NUPI",
                    "description": "Nuovo Progetto italiano is a multimedia language and civilisation course that combines a variety of activities for students with easy-to-follow grammar tables, modern illustrations and authentic Italian material."
                }
            ]
        }
    },
    {
        "title": "Train your listening skills",
        "references": {
            "info": "Use listening practice material:",
            "links": [
                {
                    "link": "https://www.italianbookshop.co.uk/italianbooks/series/m2/c31/6/ASCL",
                    "description": "T. Marin «Primo Ascolto», «Ascolto Medio», «Ascolto Avanzato». Each textbook offers a series of comprehension exercises based on the audio-recordings, which themselves contain over 40 different, yet authentic, voices."
                },
                {
                    "link": "https://www.italianbookshop.co.uk/italianbooks/series/m2/c31/6/CIVU",
                    "description": "Filomena Anzivino e Katia D’Angelo «Ci vuole orecchio». Each track is followed by several stimulating activities devoted to language comprehension and analysis.  The transcritps and answers to the exercises can be found at the back of the book, making this series ideal for classroom use and independent learners."
                }
            ]
        }
    },
    {
        "title": "Train your speaking skills",
        "references": {
            "info": "Use this practice material:",
            "links": [
                {
                    "link": "https://www.italianbookshop.co.uk/italianbooks/series/m2/c32/6/PROR",
                    "description": "T. Marin «La prova orale» successfully uses colour photos and various teaching techniques to constantly motivate students and make conversation spontaneous and interesting"
                } 
            ]
        }
    },
    {
        "title": "Train your writing skills",
        "references": {
            "info": "Use the material to practice writing:",
            "links": [
                {
                    "link": "https://www.amazon.com/Scrivere-quasi-Italian-Elisabetta-Perini/dp/8809766911",
                    "description": "It is a book for anyone who studies Italian, whether basic or advanced level."
                } ,
                {
                    "link": "https://www.amazon.com/Strategie-scrittura-Italian-Lucia-Cini/dp/8875733481",
                    "description": "Writing strategies aims to develop writing skills in teaching contexts of Italian as a foreign language or ethnic language accompanying the student along a path in which he will acquire those strategies and techniques that lead to the writing of a text."
                }
            ]
        }
    },
    {
        "title": "Lexical exercises",
        "references": {
            "info": "Increase your vocabulary with these materials:",
            "links": [
                {
                    "link": "https://www.italianbookshop.co.uk/italianbooks/9788861820784/italiano-in-cinque-minuti-italian-volume-1-level-a1-a2-sabrina-galasso-giuliana-trama",
                    "description": "Sabrina Galasso e Giuliana Trama «Italiano in cinque minuti». A very Italian-in-context way to improve vocabulary and language structures throughout grammar and lexicon exercises aiming to improve the use of Italian in all contexts."
                },
                {
                    "link": "https://www.amazon.co.uk/Attiva-Lessico-B1-B2-Esercitarsi/dp/8800806503",
                    "description": "These two books offer adult self-learners of Italian activities to revise, consolidate and enrich their vocabulary."
                },
                {
                    "link": "https://www.amazon.co.uk/Italiano-modo-dire-espressioni-idiomatiche/dp/3190054312",
                    "description": "Gianluca Aprile «Italiano per modo di dire» presents a wide range of idiomatic phrases, proverbs and sayings commonly used in the Italian language."
                },
                {
                    "link": "https://www.amazon.co.uk/parole-italiane-Silvia-Bertoni/dp/8886440928",
                    "description": "Aimed at beginners, intermediate and advanced students, \"Le parole italiane\" offers a wide variety of exercises and games aimed at teaching students how to memorise and implement Italian vocabulary."
                },
                {
                    "link": "https://www.amazon.co.uk/Dirty-Italian-Everyday-Slang-Whats/dp/1612430228",
                    "description": "Next time you’re in Italy or just chattin’ in Italian with your friends, drop the textbook formality and bust out with expressions they never teach you in school."
                }
            ]
        }
    },
    {
        "title": "Use videos for your training",
        "references": {
             "info": "Use youtube it is really rich in useful videos:",
            "links": [
                {
                    "link": "https://www.youtube.com/channel/UCN5zwIR-N3WitHgyBrRPbfQ",
                    "description": "The Italian teacher talks about Italian grammar in an interesting way."
                },
                {
                    "link": "https://www.youtube.com/channel/UCqynoHlSemIdPG676QnDxqg",
                    "description": "ALMA.tv is a web tv dedicate to Italian language and culture. If you are either a teacher, a student or just a fan of Italian language and culture, this is the right channel for you!"
                },
                {
                    "link": "https://www.youtube.com/channel/UCXGt7134NOG1mgS6Ox7edtw",
                    "description": "Italy Made Easy is the channel and brand that helps English speakers learn, practice, improve and master the Italian language."
                },
                {
                    "link": "https://www.youtube.com/c/CasaSurace",
                    "description": "Funny videos about the cultural differences between the Italian South and the North."
                },
                {
                    "link": "https://www.youtube.com/channel/UCtIM4UVDtJT4BaE4aujBWOw",
                    "description": "MTV Italia."
                }
            ]
        }
    }
]












